Приложение/DataProcessors/Главная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>Главная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Приложение/AccumulationRegisters/ОстаткиРейтинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРейтинга</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Приложение/InformationRegisters/ПолученныеДостижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПолученныеДостижения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Достижение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Достижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Приложение/InformationRegisters/Telegram_Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Telegram_Пользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDПользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Приложение/DataProcessors/Главная/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьОтчетыРейтинг(); 
	АктуальностьДанных = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьОтчетыРейтинг();
КонецПроцедуры

#Область Рейтинг

&НаКлиенте
Процедура Рейтинг(Команда)
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.ПерваяСтраница;  
	ЗаполнитьОтчетыРейтинг();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчетыРейтинг()
	ЗаполнитьТоп();	
	ЗаполнитьТопГрупп();
КонецПроцедуры

&Насервере
Процедура ЗаполнитьТопГрупп() 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиРейтингаОстатки.Студент.Владелец КАК Группа,
	|	СУММА(ОстаткиРейтингаОстатки.РейтингОстаток) КАК Рейтинг
	|ИЗ
	|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиРейтингаОстатки.Студент.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рейтинг УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();   
	Место = 1;    
	ТабЗнач = Новый ТаблицаЗначений; 
	ТабЗнач.Колонки.Добавить("Место");
	ТабЗнач.Колонки.Добавить("Группа");
	ТабЗнач.Колонки.Добавить("ОбщийРейтингГруппы");
	
	Для каждого Строка Из Таблица Цикл  
		Если Место<11 Тогда
			
			СтрокаТЗ = ТабЗнач.Добавить();
			СтрокаТЗ.Место = Строка(Место);
			СтрокаТЗ.Группа =   Строка.Группа;
			СтрокаТЗ.ОбщийРейтингГруппы = Строка.Рейтинг;
			Место = Место+1;
			
		КонецЕсли;
		
	КонецЦикла;  
	ТопГрупп.Загрузить(ТабЗнач);
КонецПроцедуры

&Насервере
Процедура ЗаполнитьТоп()
	Перем Место;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиРейтингаОстатки.Студент КАК Студент,
	|	ОстаткиРейтингаОстатки.РейтингОстаток КАК РейтингОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейтингОстаток УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();   
	Место = 1;    
	ТабЗнач = Новый ТаблицаЗначений; 
	ТабЗнач.Колонки.Добавить("МестоВТопе");
	ТабЗнач.Колонки.Добавить("Студент");
	ТабЗнач.Колонки.Добавить("Рейтинг");
	
	Для каждого Строка Из Таблица Цикл  
		Если Место<11 Тогда
			
			СтрокаТЗ = ТабЗнач.Добавить();
			СтрокаТЗ.МестоВТопе = Строка(Место);
			СтрокаТЗ.Студент =   Строка.Студент;
			СтрокаТЗ.Рейтинг = Строка.РейтингОстаток;
			Место = Место+1;
			
		КонецЕсли;
		
	КонецЦикла;  
	Топ10.Загрузить(ТабЗнач);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЗаполнитьОтчетыРейтинг();
	АктуальностьДанных = ТекущаяДата();
КонецПроцедуры    


#КонецОбласти


#Область Достижения  

&НаКлиенте
Процедура Достижения(Команда)
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.ВтораяСтраница;   
	АктуальностьДанных = ТекущаяДата(); 
	ЗаполнитьОтчетыДостижения();
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьДанныеДостижения(Команда)
	ЗаполнитьОтчетыДостижения();
	АктуальностьДанных = ТекущаяДата();
КонецПроцедуры    

&НаКлиенте
Процедура ЗаполнитьОтчетыДостижения()       
	ДиаграммаРедкостиДостижений(); 
КонецПроцедуры

&НаСервере
Процедура ДиаграммаРедкостиДостижений()
	
	РедкостьДостижений.Очистить();
	РедкостьДостижений.АвтоТранспонирование = ЛОЖЬ;
	РедкостьДостижений.Обновление = ЛОЖЬ;
	РедкостьДостижений.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолученныеДостижения.Достижение.Код КАК Достижение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолученныеДостижения.Студент) КАК Студенты
	|ИЗ
	|	РегистрСведений.ПолученныеДостижения КАК ПолученныеДостижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ПолученныеДостижения.Достижение.Код
	|ИТОГИ
	|	СУММА(Студенты)
	|ПО
	|	Достижение";
	
	РезультатЗапроса = Запрос.Выполнить();   	
	Диаграмма = ЭтаФорма.РедкостьДостижений;  
	Диаграмма.ИсточникДанных = РезультатЗапроса; 
	РедкостьДостижений.АвтоТранспонирование = Истина;
	РедкостьДостижений.Обновление = Истина;
	
КонецПроцедуры


Функция ПолучитьДанныеДляДиаграммыДостижений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолученныеДостижения.Достижение КАК Достижение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолученныеДостижения.Студент) КАК Студент
	|ИЗ
	|	РегистрСведений.ПолученныеДостижения КАК ПолученныеДостижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ПолученныеДостижения.Достижение";
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ПрНомерЗаписи = 0;
	СтрутураДанных = Новый Структура;
	
	Для каждого ТекСтрока Из ТаблицаЗначений Цикл
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Достижение",ТекСтрока.Достижение);
		СтруктураСтроки.Вставить("Студент",ТекСтрока.Студент);
		СтруктураСтроки.Вставить("Запись" + Строка(ПрНомерЗаписи),СтруктураСтроки);
		ПрНомерЗаписи = ПрНомерЗаписи +1;
	КонецЦикла;
	Возврат СтрутураДанных;
КонецФункции // ()


#КонецОбласти


#Область Телеграм

&НаКлиенте
Процедура Telegram(Команда)
	Элементы.СтраницыДашборда.ТекущаяСтраница = Элементы.ТретьяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьБота(Команда)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроцедура",5);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияПроцедура() 
	
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРассылку(Команда)
	ОтправитьРассылкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьРассылкуНаСервере()
	ТекстСообщения = ЭтотОбъект.ГрупповаяРассылка;
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Telegram_Пользователи.IDПользователя КАК IDПользователя
	|ИЗ
	|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Telegram_Сервер.ОтправитьСообщение(ВыборкаДетальныеЗаписи.IDПользователя,ТекстСообщения)
	КонецЦикла;	
	ЭтотОбъект.ГрупповаяРассылка = "";
	Объект.Студент="";
	Объект.Группа = "";

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПользователю(Команда)
	ОтправитьСообщениеПользователюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеПользователюНаСервере() 
	ТекстСообщения = ЭтотОбъект.СообщениеДляПользователя;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Telegram_Пользователи.IDПользователя КАК IDПользователя
		|ИЗ
		|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Студенты КАК Студенты
		|		ПО Telegram_Пользователи.Телефон = Студенты.Телефон
		|ГДЕ
		|	Студенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Студент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Telegram_Сервер.ОтправитьСообщение(ВыборкаДетальныеЗаписи.IDПользователя,ТекстСообщения)
	КонецЦикла;
	
	ЭтотОбъект.СообщениеДляПользователя = "";
	Объект.Студент="";
	Объект.Группа = "";

		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеГруппе(Команда)
	ОтправитьСообщениеГруппеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеГруппеНаСервере()
	ТекстСообщения = ЭтотОбъект.СообщениеДляГруппы; 
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Владелец КАК Владелец,
		|	Telegram_Пользователи.IDПользователя КАК IDПользователя
		|ИЗ
		|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Студенты КАК Студенты
		|		ПО Telegram_Пользователи.Телефон = Студенты.Телефон
		|ГДЕ
		|	Студенты.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Группа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Telegram_Сервер.ОтправитьСообщение(ВыборкаДетальныеЗаписи.IDПользователя,ТекстСообщения)
	КонецЦикла;
	
	ЭтотОбъект.СообщениеДляГруппы = "";
	Объект.Студент="";
	Объект.Группа = "";
	
КонецПроцедуры



#КонецОбласти
